app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    #authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.all

SELECT `users`.* FROM `users` WHERE `users`.`user_type` = 'Member'
---
  def show_members
    #authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.where(:user_type => 'Member')

SELECT `users`.* FROM `users` WHERE `users`.`user_type` = 'Supplier'
---
  def show_suppliers
    #authorize! :indsex, @user, :message => 'Not authorized as an administrator.'
    @users = User.where(:user_type => 'Supplier')

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `user_type` = 'Supplier', `updated_at` = '2014-04-09 13:21:17' WHERE `users`.`id` = 3
---
  def update
   # authorize! :update, @user, :message => 'Not authorized as an administrator.'
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy

    user = User.find(params[:id])
    if user_signed_in? && current_user.user_type=="admin"
      user.destroy